---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceTypes
source: html/5baf8951-9e05-5a7d-a507-ec2a0161d3da.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes

Provides a container of all Revit built-in ExternalResourceType instances.

## Syntax (C#)
```csharp
public static class ExternalResourceTypes
```